if (typeof locales == 'undefined') locales = {};
locales["ru"] = {
  "lang": {
    "message": "Русский"
  },
  "font": {
    "message": "Arial"
  },
  "page_title": {
    "message": "Симуляция оптических лучей"
  },
  "title": {
    "message": "Симуляция оптических лучей"
  },
  "description": {
    "message": "Веб-приложение с открытым исходным кодом симулируещее отражение и рефракцию света.<br>Написано на HTML, CSS и JavaScript."
  },
  "start": {
    "message": "Запустить приложение"
  },
  "github_link": {
    "message": "Посмотреть на GitHub"
  },
  "start-old": {
    "message": "Запустить старую версию"
  },
  "tools": {
    "message": "Инструменты"
  },
  "ray": {
    "message": "Луч"
  },
  "ray_desc": {
    "message": "Одиночный луч света определенный двумя точками."
  },
  "beam": {
    "message": "Пучок"
  },
  "beam_desc": {
    "message": "Пучок параллельных лучей исходит из прямой. Плотность лучей конторолируется ползунком \"Плотность лучей\"."
  },
  "point_source": {
    "message": "Точечный источник"
  },
  "point_source_desc": {
    "message": "Лучи исходят из точки. Плотность лучей конторолируется ползунком \"Плотность лучей\"."
  },
  "mirror": {
    "message": "Зеркало"
  },
  "mirror_desc": {
    "message": "Симулирует отражение света в зеркале."
  },
  "mirror_arc": {
    "message": "Зеркало (Дуга)"
  },
  "mirror_arc_desc": {
    "message": "Зеркало в форме дуги. Задается тремя точками."
  },
  "ideal_curved_mirror": {
    "message": "Идеальное кривое зеркало"
  },
  "ideal_curved_mirror_desc": {
    "message": "Идеальное \"кривое\" зеркало, которое идеально подчиняется уравнению зеркала (1/p + 1/q = 1/f). Фокальное расстояние задается в пикселях."
  },
  "glass_halfplane": {
    "message": "Стекло"
  },
  "glass_halfplane_desc": {
    "message": "Симулирует рефракцию и отражение света на поверхности."
  },
  "glass_circle": {
    "message": "Стекло (Круг)"
  },
  "glass_circle_desc": {
    "message": "Круглое стекло. Задается центром и точкой."
  },
  "glass": {
    "message": "Стекло (Другие формы)"
  },
  "glass_desc": {
    "message": "Стекло, форма которого состоит из отрезков и дуг. Включает в себя призмы и \"сферические\" линзы."
  },
  "ideal_lens": {
    "message": "Стекло (Идеальная линза)"
  },
  "ideal_lens_desc": {
    "message": "Идеальная линза, которая строго подчиняется уравнению плоской линзы (1/d + 1/f = 1/F). The focal length (in pixels) can be set directly."
  },
  "blocker": {
    "message": "Блокатор"
  },
  "blocker_desc": {
    "message": "Отрезок, поглощающий свет."
  },
  "ruler": {
    "message": "Линейка"
  },
  "ruler_desc": {
    "message": "Линейка от нуля до определенной точки. Масштаб в пикселях."
  },
  "protractor": {
    "message": "Транспортир"
  },
  "protractor_desc": {
    "message": "Транспортир, нулевое значение которого задается центром и другой точкой. Масштаб в градусах."
  },
  "views": {
    "message": "Виды отображения"
  },
  "rays": {
    "message": "Лучи"
  },
  "rays_desc": {
    "message": "Показываются лучи. Когда \"плотность лучей\" высока, они выглядят как единый пучок."
  },
  "extended_rays": {
    "message": "Продленные лучи"
  },
  "extended_rays_desc": {
    "message": "Показываются и лучи, и их продолжения. Оранжевые лучи - продолжения назад, серые - вперед."
  },
  "all_images": {
    "message": "Все изображения"
  },
  "all_images_desc": {
    "message": "Показываются все изображения. Желтые точки означают реальные изображения, оранжевые - мнимые, серые (нет на данном рисунке) - виртуальные обьекты. Заметьте, что если \"плотность лучей\" недостаточно велика, некоторые изображения не будут видны."
  },
  "seen_by_observer": {
    "message": "Видимое наблюдателем"
  },
  "seen_by_observer_desc": {
    "message": "Симулировать лучи и изображения, видимые из какой-то позиции. Синий круг - наблюдатель. Лучи пересекающие его, считаются \"видимыми\". Наблюдатель не знает где лучи начинаются на самом деле, но может думать, что они начинаются в какой-то точке/точках, если они там пересекаются. Видимые лучи показаны синим, а точки оранжевым."
  },
  "language": {
    "message": "Язык: Русский"
  },
  "footer_message": {
    "message": "Разработано <a href='https://github.com/ricktu288' style='color:rgba(255,255,255,0.25)'>ricktu288</a>, <a href='https://github.com/j3soon' style='color:rgba(255,255,255,0.25)'>j3soon</a>"
  }
};